#### MYSQL-Database

In [ ]:
#First we need to install mysql connector of python, to run database quries.

In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\svish\anaconda3\lib\site-packages (8.0.29)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\svish\anaconda3\lib\site-packages (from mysql-connector-python) (4.21.5)

In [28]:
# import mysql.connector as connection

# try :
#     mydb = connection.connect(host = "localhost",user = "root",passwd = "Vishal@9850",use_pure = True )

#     #check if the connection is established

#     query = "SHOW DATABASES"
#     cursor = mydb.cursor()
#     cursor.execute(query)
#     print(cursor.fetchall())

# except Exception as e:
#     mydb.close()
#     print(str(e))

In [1]:
import mysql.connector as connection
mydb = connection.connect(host = "localhost",user = "root",passwd = "Vishal@9850",use_pure = True )
cursor = mydb.cursor()
cursor.execute("show databases")
print(cursor.fetchall())

[('cricket_analysis',), ('ineuron',), ('information_schema',), ('lco_users',), ('mydatabase',), ('mysql',), ('performance_schema',), ('photo_store',), ('sakila',), ('sample',), ('sys',), ('training',)]

In [38]:
mydb.commit()
cursor = mydb.cursor()

In [2]:
cursor.execute("use lco_users")
mydb.commit()

In [4]:
cursor = mydb.cursor()
cursor.execute("show tables")
print(cursor.fetchall())

[('customers',), ('mydata1',), ('students',)]

#### To check whether the database is connected or not.

In [6]:
mydb = connection.connect(host = "localhost",database = 'lco_users',user = "root",passwd = "Vishal@9850",use_pure = True )
mydb.is_connected()

True

#### Using pandas library to show data in the format of dataframe

In [8]:
import pandas as pd

In [9]:
cursor = mydb.cursor()
pd.read_sql("select * from customers",mydb)

   cust_id first_name last_name  age        cust_email
0        1        Raj     Kumar   25     raj@gmail.com
1        2      Radhe     Tuwar    5   radhe@gmail.com
2        3       Sham      None   20     raj@gmail.com
3        4       Abhi    Jadhav   18  jabgis@gmail.com
4        5       Akki    Parmar   20  akki12@gmail.com
5        6      Pyare     Mohan   28  pmohan@gmail.com

In [13]:
mydb.commit()
cursor = mydb.cursor()
#cursor.execute('DESC students')
pd.read_sql('DESC students',mydb)
#print(cursor.fetchall())

          Field            Type Null  Key Default           Extra
0            id          b'int'   NO  PRI    None  auto_increment
1         email  b'varchar(60)'  YES         None
2    first_name  b'varchar(50)'  YES         None
3     last_name  b'varchar(50)'  YES         None
4   login_count          b'int'  YES         None
5  course_count          b'int'  YES         None
6  signup_month  b'varchar(20)'  YES         None

In [14]:
pd.read_sql('DESC mydata1',mydb)

     Field            Type Null Key Default Extra
0       id          b'int'  YES        None
1  emailid  b'varchar(20)'  YES        None
2   f_name  b'varchar(10)'  YES        None
3   l_name  b'varchar(20)'  YES        None
4  l_count          b'int'  YES        None
5  c_count          b'int'  YES        None
6  s_month  b'varchar(20)'  YES        None

In [17]:
# mydb.commit()
# cursor = mydb.cursor()
# cursor.execute('drop table mydata1')
# mydb.close()

In [18]:
mydb = connection.connect(host = "localhost",database = 'lco_users',user = "root",passwd = "Vishal@9850",use_pure = True )
cursor = mydb.cursor()
cursor.execute('show tables')
print(cursor.fetchall())

[('customers',), ('students',)]